In [1]:
import numpy as np
import pandas as pd

In [3]:
df1=pd.DataFrame(np.random.randn(8,5),index='A B C D E F G H'.split(),columns='score1 score2 score3 score4 score5'.split())

In [4]:
df1

     score1    score2    score3    score4    score5
A -1.534454  1.504409 -0.451095 -0.510168  1.257192
B -0.133798  0.081894 -0.625433  0.860871  0.703052
C  0.001403  0.630194 -2.035622  0.890894  0.747652
D -0.444053 -1.371175  0.804004  0.897754 -0.210789
E -0.111575 -0.906999  0.369558 -1.296169 -0.065465
F -0.157804  0.777008  0.456199  0.162007 -1.017627
G -0.286458 -0.538815 -0.960158  0.693777  0.716183
H  1.616148 -1.343950  0.357249  0.276601 -0.185015

In [5]:
df1['score1']

A   -1.534454
B   -0.133798
C    0.001403
D   -0.444053
E   -0.111575
F   -0.157804
G   -0.286458
H    1.616148
Name: score1, dtype: float64

In [6]:
df1['score6']=df1['score2']+df1['score2']
df1['score6']

A    3.008818
B    0.163787
C    1.260388
D   -2.742351
E   -1.813998
F    1.554015
G   -1.077630
H   -2.687899
Name: score6, dtype: float64

In [8]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','kabaddi','golf'])
sports1

cricket     1
football    2
kabaddi     3
golf        4
dtype: int64

In [11]:
df2={'id':[1,2,3,4],'name':['kohli','manish','bharath','kiran'],'salary':['200k','100k','50k','60k']}
df=pd.DataFrame(df2)
df

   id     name salary
0   1    kohli   200k
1   2   manish   100k
2   3  bharath    50k
3   4    kiran    60k

In [13]:
df[['name','salary']]

      name salary
0    kohli   200k
1   manish   100k
2  bharath    50k
3    kiran    60k

In [14]:
df.drop(3)
df

   id     name salary
0   1    kohli   200k
1   2   manish   100k
2   3  bharath    50k
3   4    kiran    60k